Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes
The CurvedDimensionSetOrthogonalAttributes class contains the attributes for managing all the attributes
of the curved dimension with orthogonal reference lines.

Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes.#ctor
Creates a new curved dimension set orthogonal attributes instance which loads standard attributes.

Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes.#ctor(System.String)
Creates a new curved dimension set orthogonal attributes instance that loads the specified attributes.
AttributesFile: The attributes file's filename.

Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes.#ctor(System.Boolean)
Creates a new curved dimension set orthogonal attributes instance that loads the specified attributes.
SkipLoadingAttributes: If it set to true attributes won't be lodaded.

Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes.LoadAttributes(System.String)
Loads the attributes from the attribute file.
attributeFilename: The filename of the attribute file.
Returns: True if the attributes are loaded correctly. False if the attribute file loading failed.

Tekla.Structures.Drawing.CurvedDimensionSetOrthogonal.CurvedDimensionSetOrthogonalAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.